# Taps
tap "coursier/formulas"
tap "hudochenkov/sshpass"
tap "sdkman/tap"

# CLI essentials
brew "bat"
brew "curl"
brew "fd"
brew "fish"
brew "gh"
brew "git"
brew "gnupg"
brew "htop"
brew "jq"
brew "lazygit"
brew "midnight-commander"
brew "neovim"
brew "pwgen"
brew "ripgrep"
brew "stow"
brew "tree"
brew "wget"

# Networking / DNS
brew "bind"      # dig with DoH support (keg-only, see config.fish PATH)
brew "dnstop"
brew "openconnect"
brew "xray"

# Build tools
brew "cmake"
brew "pkgconf"
brew "tree-sitter"

# Languages / runtimes
brew "node"
brew "proto"

# Java / Scala / Protobuf
brew "google-java-format"
brew "protobuf"
brew "coursier/formulas/coursier"

# Database
brew "libpq", link: true

# Images
brew "imagemagick"
brew "webp"

# AI / agents
brew "aider"
brew "ollama"
brew "opencode"
brew "pi-coding-agent"

# Misc
brew "hudochenkov/sshpass/sshpass"

# Casks (GUI apps)
cask "adguard-vpn@nightly"
cask "claude-code"
cask "firefox"
cask "font-jetbrains-mono"
cask "google-chrome"
cask "intellij-idea"
cask "kitty"
cask "obsidian"
cask "orbstack"
cask "outline-manager"
cask "rectangle"
cask "rustrover"
cask "spotify"
cask "sublime-text"

# Cargo (Rust)
cargo "cargo-audit"
cargo "cargo-watch"
